In [1]:
import pandas as pd

In [3]:
data_1 = [12,23,45,67,15,20,19]
data_2 = [54,23,43,16,36,41,10]

series_1 = pd.Series(data_1, index = ['a', 'b', 'c', 'd', 'e', 'f', 'g'])
series_2 = pd.Series(data_2, index = ['e', 'g', 'h', 'c', 'a', 'i', 'k'])

In [5]:
dataset = series_1 + series_2

In [6]:
dataset

a    48.0
b     NaN
c    61.0
d     NaN
e    69.0
f     NaN
g    42.0
h     NaN
i     NaN
k     NaN
dtype: float64

# Handle Missing Values

In [7]:
dataset.isnull()

a    False
b     True
c    False
d     True
e    False
f     True
g    False
h     True
i     True
k     True
dtype: bool

In [8]:
dataset.dropna()

a    48.0
c    61.0
e    69.0
g    42.0
dtype: float64

In [9]:
dataset

a    48.0
b     NaN
c    61.0
d     NaN
e    69.0
f     NaN
g    42.0
h     NaN
i     NaN
k     NaN
dtype: float64

In [10]:
dataset.fillna(0)

a    48.0
b     0.0
c    61.0
d     0.0
e    69.0
f     0.0
g    42.0
h     0.0
i     0.0
k     0.0
dtype: float64

In [11]:
dataset.dropna(inplace=True)

In [12]:
dataset

a    48.0
c    61.0
e    69.0
g    42.0
dtype: float64

In [26]:
df = pd.DataFrame({
    "Bahubali" : [5,4,5,5,3,4,5],
    "Batman" : [4,5,4,3,4,5,4]
},
    index = ["Akash", "Ravi", "Amit", "Anuj", "Mukesh", "Pooja", "Ekta"])

In [27]:
df

        Bahubali  Batman
Akash          5       4
Ravi           4       5
Amit           5       4
Anuj           5       3
Mukesh         3       4
Pooja          4       5
Ekta           5       4

In [28]:
df.sort_values('Bahubali')

        Bahubali  Batman
Mukesh         3       4
Ravi           4       5
Pooja          4       5
Akash          5       4
Amit           5       4
Anuj           5       3
Ekta           5       4